wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/CMSIS/GD/GD32H77x/Source/IAR/startup_gd32h77x.s
        PUBWEAK TIMER30_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER30_DEC_IRQHandler
        B TIMER30_DEC_IRQHandler

        PUBWEAK TIMER31_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER31_DEC_IRQHandler
        B TIMER31_DEC_IRQHandler

        PUBWEAK CPU_DCACHE_ERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CPU_DCACHE_ERR_IRQHandler
        B CPU_DCACHE_ERR_IRQHandler

        PUBWEAK CPU_ICACHE_ERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CPU_ICACHE_ERR_IRQHandler
        B CPU_ICACHE_ERR_IRQHandler

        PUBWEAK VCORE_OVER_UNDER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
VCORE_OVER_UNDER_IRQHandler
        B VCORE_OVER_UNDER_IRQHandler

        PUBWEAK TIMER0_Channel_BRK_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_Channel_BRK_IRQHandler
        B TIMER0_Channel_BRK_IRQHandler

        PUBWEAK TIMER7_Channel_BRK_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_Channel_BRK_IRQHandler
        B TIMER7_Channel_BRK_IRQHandler

        PUBWEAK DSI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DSI_IRQHandler
        B DSI_IRQHandler

        PUBWEAK PKCAU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PKCAU_IRQHandler
        B PKCAU_IRQHandler

        PUBWEAK ESC_BRIDGE_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ESC_BRIDGE_IRQHandler
        B ESC_BRIDGE_IRQHandler

        PUBWEAK EDIM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EDIM_IRQHandler
        B EDIM_IRQHandler

        END
